#include "Rules.h"

// рисует игровое поле, учитывая происходящие в нём в ходе игры изменения
void map(char board[])
{
	cout << "\n\n\n"; cout << " Игровое поле: " << "\n\n";
	cout << " " << board[6] << "|" << board[7] << "|" << board[8] << endl;
	cout << " " << "-" << "+" << "-" << "+" << "-" << endl;
	cout << " " << board[3] << "|" << board[4] << "|" << board[5] << endl;
	cout << " " << "-" << "+" << "-" << "+" << "-" << endl;
	cout << " " << board[0] << "|" << board[1] << "|" << board[2] << endl;
	cout << "\n\n";
}


/* показывает "горячие клавиши" (чтобы было понятно, какой
номер какой клетке присвоен для дальнейшей игры)*/
void control_buttons(char board[])
{
	// рисует игровое поле,
	map(board);
	// заполняет ячейки массива карты "горячими клавишами"
	for (int i = 0; i < 9; ++i)
	{
		board[i] = '1' + i;
	}
}